Revit 2027 API
BuiltInFailures.StairRampFailures.InvalidStairsPathFailure Property
 Invalid stairs path provided.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId InvalidStairsPathFailure { get; }
Public Shared ReadOnly Property InvalidStairsPathFailure As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ InvalidStairsPathFailure {
	FailureDefinitionId^ get ();
}
static member InvalidStairsPathFailure : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.StairRampFailures Class
Autodesk.Revit.DB Namespace